IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28004x_analog_subsys_regs.xml
<module id="ANALOG_SUBSYS_REGS" HW_revision="" description="ANALOG SUBSYS Registers">
	<register id="ANAREFPP" width="16" page="1" offset="0x1e" internal="0" description="ADC Analog Reference Peripheral Properties register">
		<bitfield id="ANAREFBDIS" description="Disable ANAREFB" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ANAREFCDIS" description="Disable ANAREFC" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="TSNSCTL" width="16" page="1" offset="0x60" internal="0" description="Temperature Sensor Control Register">
		<bitfield id="ENABLE" description="Temperature Sensor Enable" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="ANAREFCTL" width="16" page="1" offset="0x68" internal="0" description="Analog Reference Control Register">
		<bitfield id="ANAREFASEL" description="Analog Reference A Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ANAREFBSEL" description="Analog Reference B Select" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ANAREFCSEL" description="Analog Reference C Select" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ANAREFA2P5SEL" description="Analog Reference A Select" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="ANAREFB2P5SEL" description="Analog Reference B Select" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="ANAREFC2P5SEL" description="Analog Reference B Select" begin="10" end="10" width="1" rwaccess="RW"/>
	</register>
	<register id="VMONCTL" width="16" page="1" offset="0x70" internal="0" description="Voltage Monitor Control Register">
		<bitfield id="BORLVMONDIS" description="Disable BORL(ow) feature on VDDIO" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="DCDCCTL" width="32" page="1" offset="0x78" internal="0" description="DC-DC control register.">
		<bitfield id="DCDCEN" description="DCDC Enable" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="DCDCSTS" width="16" page="1" offset="0x7a" internal="0" description="DC-DC status register.">
		<bitfield id="INDDETECT" description="Inductor Detected" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SWSEQDONE" description="Switch sequence to DC-DC done." begin="1" end="1" width="1" rwaccess="R"/>
	</register>
	<register id="CMPHPMXSEL" width="32" page="1" offset="0x82" internal="0" description="Bits to select one of the many sources on CopmHP inputs. Refer to Pimux diagram for details.">
		<bitfield id="CMP1HPMXSEL" description="CMP1HPMXSEL bits" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CMP2HPMXSEL" description="CMP2HPMXSEL bits" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="CMP3HPMXSEL" description="CMP3HPMXSEL bits" begin="8" end="6" width="3" rwaccess="RW"/>
		<bitfield id="CMP4HPMXSEL" description="CMP4HPMXSEL bits" begin="11" end="9" width="3" rwaccess="RW"/>
		<bitfield id="CMP5HPMXSEL" description="CMP5HPMXSEL bits" begin="14" end="12" width="3" rwaccess="RW"/>
		<bitfield id="CMP6HPMXSEL" description="CMP6HPMXSEL bits" begin="18" end="16" width="3" rwaccess="RW"/>
		<bitfield id="CMP7HPMXSEL" description="CMP7HPMXSEL bits" begin="21" end="19" width="3" rwaccess="RW"/>
	</register>
	<register id="CMPLPMXSEL" width="32" page="1" offset="0x84" internal="0" description="Bits to select one of the many sources on CopmLP inputs. Refer to Pimux diagram for details.">
		<bitfield id="CMP1LPMXSEL" description="CMP1LPMXSEL bits" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CMP2LPMXSEL" description="CMP2LPMXSEL bits" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="CMP3LPMXSEL" description="CMP3LPMXSEL bits" begin="8" end="6" width="3" rwaccess="RW"/>
		<bitfield id="CMP4LPMXSEL" description="CMP4LPMXSEL bits" begin="11" end="9" width="3" rwaccess="RW"/>
		<bitfield id="CMP5LPMXSEL" description="CMP5LPMXSEL bits" begin="14" end="12" width="3" rwaccess="RW"/>
		<bitfield id="CMP6LPMXSEL" description="CMP6LPMXSEL bits" begin="18" end="16" width="3" rwaccess="RW"/>
		<bitfield id="CMP7LPMXSEL" description="CMP7LPMXSEL bits" begin="21" end="19" width="3" rwaccess="RW"/>
	</register>
	<register id="CMPHNMXSEL" width="16" page="1" offset="0x86" internal="0" description="Bits to select one of the many sources on CopmHN inputs. Refer to Pimux diagram for details.">
		<bitfield id="CMP1HNMXSEL" description="CMP1HNMXSEL bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMP2HNMXSEL" description="CMP2HNMXSEL bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMP3HNMXSEL" description="CMP3HNMXSEL bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMP4HNMXSEL" description="CMP4HNMXSEL bits" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMP5HNMXSEL" description="CMP5HNMXSEL bits" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CMP6HNMXSEL" description="CMP6HNMXSEL bits" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMP7HNMXSEL" description="CMP7HNMXSEL bits" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="CMPLNMXSEL" width="16" page="1" offset="0x87" internal="0" description="Bits to select one of the many sources on CopmLN inputs. Refer to Pimux diagram for details.">
		<bitfield id="CMP1LNMXSEL" description="CMP1LNMXSEL bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMP2LNMXSEL" description="CMP2LNMXSEL bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMP3LNMXSEL" description="CMP3LNMXSEL bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMP4LNMXSEL" description="CMP4LNMXSEL bits" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMP5LNMXSEL" description="CMP5LNMXSEL bits" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CMP6LNMXSEL" description="CMP6LNMXSEL bits" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMP7LNMXSEL" description="CMP7LNMXSEL bits" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="LOCK" width="32" page="1" offset="0x8e" internal="0" description="Lock Register">
		<bitfield id="TSNSCTL" description="TSNSCTL Register lock bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ANAREFCTL" description="ANAREFCTL Register lock bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="VMONCTL" description="VMONCTL Register lock bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="DCDCCTL" description="DCDCCTL Register lock bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ADCINMXSEL" description="ADCINMXSEL Register lock bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CMPHPMXSEL" description="CMPHPMXSEL Register lock bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMPLPMXSEL" description="CMPLPMXSEL Register lock bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CMPHNMXSEL" description="CMPHNMXSEL Register lock bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CMPLNMXSEL" description="CMPLNMXSEL Register lock bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="VREGCTL" description="VREGCTL Register lock bit" begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
</module>
